In [7]:
import pandas as pd
import numpy as np

In [8]:
print("helo iam madan")

helo iam madan

In [16]:
s=pd.Series([[1,3,5,np.nan,6,8],[1,3,5,np.nan,6,8]])

In [17]:
s

0    [1, 3, 5, nan, 6, 8]
1    [1, 3, 5, nan, 6, 8]
dtype: object

In [46]:
d=pd.DataFrame([[-1,2,3],[6,7,8],[9,10,11]],[0,1,2],['hi','helo','kx'])

In [48]:
d

   hi  helo  kx
0  -1     2   3
1   6     7   8
2   9    10  11

In [49]:
d.dtypes

hi      int64
helo    int64
kx      int64
dtype: object

In [54]:
d.head()

   hi  helo  kx
0  -1     2   3
1   6     7   8
2   9    10  11

In [55]:
d.head(1)

   hi  helo  kx
0  -1     2   3

In [56]:
d.tail()

   hi  helo  kx
0  -1     2   3
1   6     7   8
2   9    10  11

In [57]:
d.tail(1)

   hi  helo  kx
2   9    10  11

In [59]:
d.index

Int64Index([0, 1, 2], dtype='int64')

In [61]:
d.columns

Index(['hi', 'helo', 'kx'], dtype='object')

In [63]:
d.to_numpy()

array([[-1,  2,  3],
       [ 6,  7,  8],
       [ 9, 10, 11]], dtype=int64)

In [64]:
d.describe()

             hi       helo         kx
count  3.000000   3.000000   3.000000
mean   4.666667   6.333333   7.333333
std    5.131601   4.041452   4.041452
min   -1.000000   2.000000   3.000000
25%    2.500000   4.500000   5.500000
50%    6.000000   7.000000   8.000000
75%    7.500000   8.500000   9.500000
max    9.000000  10.000000  11.000000